In [32]:
import pandas as pd
import numpy as np
from numpy.random import randn

# Dataframe has rows and columns

In [33]:
df = pd.DataFrame(randn(5,4),index = 'A B C D E'.split(),columns = 'W X Y Z'.split())

In [34]:
type(df)

pandas.core.frame.DataFrame

In [35]:
df

          W         X         Y         Z
A  0.063774  0.075844 -0.647703 -0.648088
B  1.783162 -1.353702 -0.019451  1.638078
C  0.779376  0.140140  0.905936 -0.134684
D  0.897125 -0.989226  0.497307 -0.973980
E  0.169849  0.332052 -0.400065 -1.258061

In [36]:
df[['W','Y','Z']]

          W         Y         Z
A  0.063774 -0.647703 -0.648088
B  1.783162 -0.019451  1.638078
C  0.779376  0.905936 -0.134684
D  0.897125  0.497307 -0.973980
E  0.169849 -0.400065 -1.258061

In [37]:
df.drop('X',axis =1)

          W         Y         Z
A  0.063774 -0.647703 -0.648088
B  1.783162 -0.019451  1.638078
C  0.779376  0.905936 -0.134684
D  0.897125  0.497307 -0.973980
E  0.169849 -0.400065 -1.258061

In [38]:
# axis = 0 refers row
# axis =1 refers column

In [39]:
df.drop('A', axis = 0)

          W         X         Y         Z
B  1.783162 -1.353702 -0.019451  1.638078
C  0.779376  0.140140  0.905936 -0.134684
D  0.897125 -0.989226  0.497307 -0.973980
E  0.169849  0.332052 -0.400065 -1.258061

In [40]:
df

          W         X         Y         Z
A  0.063774  0.075844 -0.647703 -0.648088
B  1.783162 -1.353702 -0.019451  1.638078
C  0.779376  0.140140  0.905936 -0.134684
D  0.897125 -0.989226  0.497307 -0.973980
E  0.169849  0.332052 -0.400065 -1.258061

In [41]:
df.drop('A', axis = 0,inplace=True)
# Inplace = true gare paxi matra data actually drop hunxa

In [42]:
df

          W         X         Y         Z
B  1.783162 -1.353702 -0.019451  1.638078
C  0.779376  0.140140  0.905936 -0.134684
D  0.897125 -0.989226  0.497307 -0.973980
E  0.169849  0.332052 -0.400065 -1.258061

In [43]:
train = pd.read_csv('titanic_train.csv')

In [44]:
train.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [45]:
train.tail(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [46]:
train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [47]:
train.columns[train.isnull().any()] #To find columns having null values

Index(['Age', 'Cabin', 'Embarked'], dtype='object')

In [48]:
train.drop(['Cabin','Embarked'], axis = 1,inplace=True)

In [49]:
train.columns[train.isnull().any()] #To find columns having null values

Index(['Age'], dtype='object')

In [50]:
train.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500

In [51]:
train['Age'] = train['Age'].fillna(train['Age'].mean()) #Replacing null value with mean of age in Age column

In [52]:
train.columns[train.isnull().any()] #To find columns having null values

Index([], dtype='object')